In [1]:
import pandas as pd

In [3]:
data = {
    'Name': ['Pandy', 'Bamboo', 'Fuzzy'],
    'Age': [5, 7, 4],
    'Bamboo_Sticks': [15, 20, 12]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             20
2   Fuzzy    4             12

In [5]:
df

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             20
2   Fuzzy    4             12

In [7]:
df.head

<bound method NDFrame.head of      Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             20
2   Fuzzy    4             12>

In [9]:
df[df['Age']<6]

    Name  Age  Bamboo_Sticks
0  Pandy    5             15
2  Fuzzy    4             12

In [11]:
df['Job']=['inter','manager','intern']
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    5             15    inter
1  Bamboo    7             20  manager
2   Fuzzy    4             12   intern

In [15]:
df.loc[df['Name']=='Pandy','Age']=6
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    6             15    inter
1  Bamboo    7             20  manager
2   Fuzzy    4             12   intern

In [23]:
df=df.drop('Bamboo_Sticks',axis=1)
df

     Name  Age      Job
0   Pandy    6    inter
1  Bamboo    7  manager
2   Fuzzy    4   intern

In [27]:
df=df.drop(['Age','Job'],axis=1)
df

     Name
0   Pandy
1  Bamboo
2   Fuzzy

In [29]:
df.iloc[0]

Name    Pandy
Name: 0, dtype: object

In [35]:
data = {
    'Name': ['Pandy', 'Bamboo', 'Fuzzy'],
    'Age': [5, 7, 4],
    'Bamboo_Sticks': [15, 20, 12]
}


df['Job']=['inter','manager','intern']

In [37]:
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    5             15    inter
1  Bamboo    7             20  manager
2   Fuzzy    4             12   intern

In [39]:
df.iloc[0]

Name             Pandy
Age                  5
Bamboo_Sticks       15
Job              inter
Name: 0, dtype: object

In [41]:
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    5             15    inter
1  Bamboo    7             20  manager
2   Fuzzy    4             12   intern

In [45]:
df.iloc[0:2,1:3]

   Age  Bamboo_Sticks
0    5             15
1    7             20

In [51]:

# Create a sample DataFrame
df = pd.DataFrame({
    'Name': ['Pandy', 'Bamboo', 'Fuzzy', 'Fluffy'],
    'Age': [5, 7, 4, 6],
    'Bamboo_Sticks': [15, 20, 12, 18]
}, index=['a', 'b', 'c', 'd'])

df

     Name  Age  Bamboo_Sticks
a   Pandy    5             15
b  Bamboo    7             20
c   Fuzzy    4             12
d  Fluffy    6             18

In [53]:
df.loc['b']

Name             Bamboo
Age                   7
Bamboo_Sticks        20
Name: b, dtype: object

In [55]:
df.loc[['a','c'],['Name','Age']]

    Name  Age
a  Pandy    5
c  Fuzzy    4

In [57]:
df_json=pd.read_json('test.json')
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [62]:
df_json.shape

(6, 4)

In [64]:
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

In [66]:
df_json.tail()

   Duration  Pulse  Maxpulse  Calories
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [113]:
df = pd.read_json('test.json')

In [115]:
df

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [123]:
df.to_csv('output.csv', index=False)

In [126]:
print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [128]:
df_csv=pd.read_csv('output.csv')

In [132]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

In [134]:
df_csv=df_csv.drop('Calories',axis=1)

In [136]:
df_csv

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

In [138]:
df.to_excel('output.xlsx', index=False)

In [141]:
df_csv[['Duration','Pulse']]

   Duration  Pulse
0        60    110
1        60    117
2        60    103
3        45    109
4        45    117
5        60    102

In [143]:
df_csv[(df_csv['Duration'] >50) & (df_csv['Pulse'] >105)]

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145

In [145]:
left = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Pandy', 'Fuzzy', 'Bamboo']
})

right = pd.DataFrame({
    'ID': [1, 2, 4],
    'Hobby': ['Climbing', 'Sleeping', 'Eating']
})


# Merge on common column ID
merged = pd.merge(left, right, on='ID', how='inner')
print(merged)

   ID   Name     Hobby
0   1  Pandy  Climbing
1   2  Fuzzy  Sleeping

In [147]:
df1 = pd.DataFrame({'Name': ['Pandy', 'Fuzzy'], 'Age': [5, 6]})
df2 = pd.DataFrame({'Name': ['Fluffy'], 'Age': [4]})

result = pd.concat([df1, df2], ignore_index=True)
print(result)

     Name  Age
0   Pandy    5
1   Fuzzy    6
2  Fluffy    4

In [149]:
# Example 2: Horizontal stacking (side-by-side)
df3 = pd.DataFrame({'A': [1, 2]})
df4 = pd.DataFrame({'B': ['X', 'Y']})

result = pd.concat([df3, df4], axis=1)
print(result)

   A  B
0  1  X
1  2  Y